[Killed] BlockStatement
src/classes/PosterSessionAreaController.ts:64:42
   /**
    * The title of the poster assigned to this area, or undefined if there is not one.
    */
-  public get title(): string | undefined {
-    return this._model.title;
-  }
+  public get title(): string | undefined {}
 
   public set title(title: string | undefined) {
killedBy: [REE1] PosterSessionAreaController Setting title property updates the property and emits a posterTitleChange event if the property changes
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "XrltsdvX3_GDGeeCkMF8u"
Received: undefined

[Killed] BlockStatement
src/classes/PosterSessionAreaController.ts:68:47
     return this._model.title;
   }
 
-  public set title(title: string | undefined) {
-    if (this._model.title !== title) {
-      this._model.title = title;
-      this.emit('posterTitleChange', title);
-    }
-  }
+  public set title(title: string | undefined) {}
 
   /**
killedBy: [REE1] PosterSessionAreaController Setting title property updates the property and emits a posterTitleChange event if the property changes
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "cxFxb3n4GiTlVysdlIbqQ"

Number of calls: 0

[Killed] ConditionalExpression
src/classes/PosterSessionAreaController.ts:69:9
   }
 
   public set title(title: string | undefined) {
-    if (this._model.title !== title) {
+    if (true) {
       this._model.title = title;
       this.emit('posterTitleChange', title);
killedBy: [REE1] PosterSessionAreaController Setting title property does not emit a posterTitleChange event if the title property does not change
statusReason: Error: expect(jest.fn()).not.toBeCalled()

Expected number of calls: 0
Received number of calls: 1

1: "65_0aIOp2CRXxONXTkfF6"

[Killed] BlockStatement
src/classes/PosterSessionAreaController.ts:69:38
   }
 
   public set title(title: string | undefined) {
-    if (this._model.title !== title) {
-      this._model.title = title;
-      this.emit('posterTitleChange', title);
-    }
+    if (this._model.title !== title) {}
   }
 
killedBy: TownController With a successful connection [T2] interactableUpdate events [REE1] PosterSessionAreaController Poster Session Area updates [REE1] interactableUpdate and poster hooks Updates the poster 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "id": "eZgR6Ad1ZhiVzeBO-CSAS",
    "imageContents": "bxptGYvzkXDFg42-7F5GG",

[Killed] StringLiteral
src/classes/PosterSessionAreaController.ts:71:17
   public set title(title: string | undefined) {
     if (this._model.title !== title) {
       this._model.title = title;
-      this.emit('posterTitleChange', title);
+      this.emit("", title);
     }
   }
killedBy: TownController With a successful connection [T2] interactableUpdate events [REE1] PosterSessionAreaController Poster Session Area updates [REE1] interactableUpdate and poster hooks Emits a posterTitle
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "KoTX_4zZ8LGkq79BxMimZ"

Number of calls: 0

[Killed] BlockStatement
src/classes/PosterSessionAreaController.ts:78:50
   /**
    * The image of the poster assigned to this area, or undefined if there is not one.
    */
-  public get imageContents(): string | undefined {
-    return this._model.imageContents;
-  }
+  public get imageContents(): string | undefined {}
 
   public set imageContents(imageContents: string | undefined) {
killedBy: [REE1] PosterSessionAreaController Setting imageContents property updates the property and emits a posterImageContentsChange event if the property changes
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "ybtiPOFZSAdPgFmNhRfAK"
Received: undefined

[Killed] BlockStatement
src/classes/PosterSessionAreaController.ts:82:63
     return this._model.imageContents;
   }
 
-  public set imageContents(imageContents: string | undefined) {
-    if (this._model.imageContents !== imageContents) {
-      this._model.imageContents = imageContents;
-      // if we're replacing the poster contents, then reset the players who starred to zero
-      this._playersWhoStarred = [];
-      this.emit('posterImageContentsChange', imageContents);
-    }
-  }
+  public set imageContents(imageContents: string | undefined) {}
 
   /**
killedBy: TownController With a successful connection [T2] interactableUpdate events [REE1] PosterSessionAreaController Poster Session Area updates [REE1] interactableUpdate and poster hooks Updates the poster 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "id": "nTjjpAdqhxYtoPjj3jXpV",
-   "imageContents": "tOGWLp_Cj8BmxUdQVtnjt",

[Killed] EqualityOperator
src/classes/PosterSessionAreaController.ts:83:9
   }
 
   public set imageContents(imageContents: string | undefined) {
-    if (this._model.imageContents !== imageContents) {
+    if (this._model.imageContents === imageContents) {
       this._model.imageContents = imageContents;
       // if we're replacing the poster contents, then reset the players who starred to zero
killedBy: [REE1] PosterSessionAreaController Setting imageContents property updates the property and emits a posterImageContentsChange event if the property changes
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "fe5bFDTtaTwMDJmZQXoVV"

Number of calls: 0

[Killed] ConditionalExpression
src/classes/PosterSessionAreaController.ts:83:9
   }
 
   public set imageContents(imageContents: string | undefined) {
-    if (this._model.imageContents !== imageContents) {
+    if (true) {
       this._model.imageContents = imageContents;
       // if we're replacing the poster contents, then reset the players who starred to zero
killedBy: [REE1] PosterSessionAreaController Setting imageContents property does not emit a posterImageContentsChange event if the title property does not change
statusReason: Error: expect(jest.fn()).not.toBeCalled()

Expected number of calls: 0
Received number of calls: 1

1: "a8xoqC0xXLcXraTM27ax2"

[Survived] ArrayDeclaration
src/classes/PosterSessionAreaController.ts:86:33
     if (this._model.imageContents !== imageContents) {
       this._model.imageContents = imageContents;
       // if we're replacing the poster contents, then reset the players who starred to zero
-      this._playersWhoStarred = [];
+      this._playersWhoStarred = ["Stryker was here"];
       this.emit('posterImageContentsChange', imageContents);
     }

[Killed] BlockStatement
src/classes/PosterSessionAreaController.ts:94:30
   /**
    * The number of stars of the poster assigned to this area.
    */
-  public get stars(): number {
-    return this._model.stars;
-  }
+  public get stars(): number {}
 
   /**
killedBy: PosterViewer [REE3] createPoster Poster Image Viewer [REE3] cant restar a poster Starring a poster Increments the number of stars when clicking "star" button
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Number of stars: undefined
Received:
  StarNumber of stars:

Ignored nodes: comments, <script />, <style />

[Killed] BlockStatement
src/classes/PosterSessionAreaController.ts:103:35
    *
    * Changing this value will emit a ‘posterStarChange' event to listeners
    */
-  public set stars(stars: number) {
-    if (this._model.stars !== stars && stars > 0) {
-      this._model.stars = stars;
-      this.emit('posterStarChange', stars);
-    }
-  }
+  public set stars(stars: number) {}
 
   public get playersWhoStarred(): string[] {
killedBy: PosterViewer [REE3] createPoster Poster Image Viewer [REE3] cant restar a poster Starring a poster Increments the number of stars when clicking "star" button
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Number of stars: 135
Received:
  StarNumber of stars: 134

Ignored nodes: comments, <script />, <style />

[Killed] ConditionalExpression
src/classes/PosterSessionAreaController.ts:104:9
    * Changing this value will emit a ‘posterStarChange' event to listeners
    */
   public set stars(stars: number) {
-    if (this._model.stars !== stars && stars > 0) {
+    if (false) {
       this._model.stars = stars;
       this.emit('posterStarChange', stars);
killedBy: [REE1] PosterSessionAreaController Setting star property updates the property and emits a posterStarChange event if the property changes
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: 2

Number of calls: 0

[Killed] ConditionalExpression
src/classes/PosterSessionAreaController.ts:104:9
    * Changing this value will emit a ‘posterStarChange' event to listeners
    */
   public set stars(stars: number) {
-    if (this._model.stars !== stars && stars > 0) {
+    if (true) {
       this._model.stars = stars;
       this.emit('posterStarChange', stars);
killedBy: [REE1] PosterSessionAreaController Setting star property does not emit a posterStarChange event if the star property does not change
statusReason: Error: expect(jest.fn()).not.toBeCalled()

Expected number of calls: 0
Received number of calls: 1

1: 1

[Killed] StringLiteral
src/classes/PosterSessionAreaController.ts:106:17
   public set stars(stars: number) {
     if (this._model.stars !== stars && stars > 0) {
       this._model.stars = stars;
-      this.emit('posterStarChange', stars);
+      this.emit("", stars);
     }
   }
killedBy: PosterViewer [REE3] createPoster Poster Image Viewer [REE3] cant restar a poster Starring a poster Increments the number of stars when clicking "star" button
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Number of stars: 135
Received:
  StarNumber of stars: 134

Ignored nodes: comments, <script />, <style />

[Killed] BlockStatement
src/classes/PosterSessionAreaController.ts:131:65
    *
    * @param updatedModel
    */
-  public updateFrom(updatedModel: PosterSessionAreaModel): void {
-    // note: this calls the setters; really we're updating the model
-    this.title = updatedModel.title;
-    this.imageContents = updatedModel.imageContents;
-    this.stars = updatedModel.stars;
-  }
+  public updateFrom(updatedModel: PosterSessionAreaModel): void {}
 }
 
killedBy: TownController With a successful connection [T2] interactableUpdate events [REE1] PosterSessionAreaController Poster Session Area updates [REE1] interactableUpdate and poster hooks Updates the poster 
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Object {
    "id": "kHSm7YveNxDEH5_IJTSf_",
-   "imageContents": "KhMQeldJ-KY4TSw7xl1oy",
